### Import required dependencies

In [27]:
import pandas as pd
import os

## Deliverable 1: Collect the Data

To collect the data that youâ€™ll need, complete the following steps:

1. Using the Pandas `read_csv` function and the `os` module, import the data from the `new_full_student_data.csv` file, and create a DataFrame called student_df. 

2. Use the head function to confirm that Pandas properly imported the data.

In [28]:
# Create the path and import the data
full_student_data = os.path.join('Challenge 4/Resources/new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)

In [29]:
# Verify that the data was properly imported
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

## Deliverable 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
1. Check for and remove all rows with `NaN`, or missing, values in the student DataFrame. 

2. Check for and remove all duplicate rows in the student DataFrame.

3. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.

4. Check data types using the `dtypes` property.

5. Remove the "th" suffix from every value in the grade column using `str` and `replace`.

6. Change the grade colum to the `int` type and verify column types.

7. Use the head (and/or the tail) function to preview the DataFrame.

In [30]:
# Check for null values
student_df.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [35]:
# Drop rows with null values and verify removal
student_df.dropna()
student_df.isnull().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [32]:
# Check for duplicated rows
student_df.count()

student_id       19514
student_name     19514
grade            19514
school_name      19514
reading_score    17546
math_score       18532
school_type      19514
school_budget    19514
dtype: int64

In [33]:
# Drop duplicated rows and verify removal
student_df = student_df.dropna(how='any')
student_df.count()

student_id       16667
student_name     16667
grade            16667
school_name      16667
reading_score    16667
math_score       16667
school_type      16667
school_budget    16667
dtype: int64

In [34]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [36]:
# Examine the grade column to understand why it is not an int
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19509    12th
19510     9th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 16667, dtype: object

In [37]:
# Remove the non-numeric characters and verify the contents of the column
student_df['grade'] = student_df['grade'].str.replace('th', '')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19509    12
19510     9
19511    11
19512    11
19513    12
Name: grade, Length: 16667, dtype: object

In [69]:
# Change the grade column to the int type and verify column types
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

## Deliverable 3: Summarize the Data

Describe the data using summary statistics on the data as a whole and on individual columns.

1. Generate the summary statistics for each DataFrame by using the `describe` function.

2. Display the mean math score using the `mean` function. 

2. Store the minimum reading score as `min_reading_score`.

In [40]:
# Display summary statistics for the DataFrame
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.666700e+04  16667.000000   16667.000000  16667.000000   16667.000000
mean   6.983096e+07     10.354053      72.395068     64.589560  893784.963581
std    3.453505e+07      1.098031      15.224093     15.816358   53963.679617
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.990829e+07      9.000000      62.300000     54.300000  846745.000000
50%    6.977253e+07     10.000000      73.800000     65.200000  893368.000000
75%    9.938019e+07     11.000000      84.000000     75.900000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [42]:
# Display the mean math score using the mean function
student_df['math_score'].mean()

64.58956020879589

In [43]:
# Store the minimum reading score as min_reading_score
min_reading_score = student_df['reading_score'].min()
min_reading_score

10.5

## Deliverable 4: Drill Down into the Data

Drill down to specific rows, columns, and subsets of the data.

To drill down into the data, complete the following steps:

1. Use `loc` to display the grade column.

2. Use `iloc` to display the first 3 rows and columns 3, 4, and 5.

3. Show the rows for grade nine using `loc`.

4. Store the row with the minimum overall reading score as `min_reading_row` using `loc` and the `min_reading_score` found in Deliverable 3.

5. Find the reading scores for the school and grade from the output of step three using `loc` with multiple conditional statements.

6. Using conditional statements and `loc` or `iloc`, find the mean reading score for all students in grades 11 and 12 combined.

In [48]:
# Use loc to display the grade column
student_df.loc[:,'grade']

0         9
1         9
2         9
3         9
5         9
         ..
19509    12
19510     9
19511    11
19512    11
19513    12
Name: grade, Length: 16667, dtype: int32

In [50]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
student_df.iloc[0:3, [3,4,5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [76]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
grade = student_df.loc[student_df["grade"] == 9, :]
grade.describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.651000e+03  4651.0    4651.000000  4651.000000    4651.000000
mean   6.989824e+07     9.0      69.215029    66.469383  898677.405074
std    3.471276e+07     0.0      15.342495    16.668006   54794.764822
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.987328e+07     9.0      59.000000    55.900000  846745.000000
50%    7.017398e+07     9.0      70.100000    67.600000  893368.000000
75%    9.959880e+07     9.0      80.600000    78.400000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [86]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [91]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
student_df.loc[(student_df["school_name"] == "Dixon High School") | (student_df["grade"] == 10), "reading_score"]

1        94.7
8        65.7
11       80.0
19       77.5
20       71.6
         ...
19490    97.6
19496    65.3
19504    67.6
19505    66.6
19508    60.5
Name: reading_score, Length: 6095, dtype: float64

In [92]:
# Find the mean reading score for all students in grades 11 and 12 combined.
student_df.loc[(student_df["grade"] == 11) | (student_df["grade"] ==12), "reading_score"].mean()

74.97740016992344

## Deliverable 5: Make Comparisons Between District and Charter Schools

Compare district vs charter schools for budget, size, and scores.

Make comparisons within your data by completing the following steps:

1. Using the `groupby` and `mean` functions, look at the average reading and math scores per school type.

1. Using the `groupby` and `count` functions, find the total number of students at each school.

2. Using the `groupby` and `mean` functions, find the average budget per grade for each school type.

In [95]:
# Use groupby and mean to find the average reading and math scores for each school type.
avg_scores = student_df.groupby(by='school_type').mean()
avg_scores.loc[:, ["math_score", "reading_score"]]

             math_score  reading_score
school_type
Charter       66.615521      72.577870
Public        62.911409      72.243649

In [96]:
# Display the average budget for each school type by using the groupby and mean functions
avg_budget = student_df.groupby(by='school_type').mean()
avg_budget.loc[:, ["school_budget"]]

             school_budget
school_type
Charter      872678.180771
Public       911268.214677

In [102]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.
total_students_by_school = student_df.groupby(by='school_name').count()
total_students_by_school.loc[:, ["student_name"]].sort_values(["student_name"], ascending=False)

                        student_name
school_name
Montgomery High School          2295
Green High School               2211
Dixon High School               1776
Wagner High School              1721
Silva High School               1248
Woods High School               1191
Sullivan High School            1079
Turner High School               961
Fisher High School               906
Bowers High School               888
Richard High School              615
Campos High School               604
Odonnell High School             518
Campbell High School             464
Chang High School                190

In [99]:
# Find the average math score by grade for each school type by using the groupby and mean functions
avg_by_school = student_df.groupby(['school_type', 'grade']).mean()
avg_by_school.loc[:, ["reading_score", "math_score"]]

                   reading_score  math_score
school_type grade
Charter     9          68.810435   70.036280
            10         69.817434   66.399295
            11         80.617947   67.825335
            12         70.673653   59.833308
Public      9          69.539520   63.608679
            10         73.116631   63.860050
            11         73.499936   59.221994
            12         73.431569   63.494754

# Deliverable 6: Summarize Your Findings
In the cell below, write a few sentences to describe any discoveries you made while performing your analysis along with any additional analysis you believe would be worthwhile.

# Sumarry of Findings 
## Purpose of Analysis
- The Purpose of this analysis was to present the data on the Pycity schools in order to make assesmenets as to preformance in key areas such as math and reading in their standardized testing 
## Analysis Summary
- In looking at the data it was important to compile it in order to be to see the trends in prefrmance among the seveal thousand student and multiple schools. To accomplish this it was important to import and read the data in the CSV and then use the functions of `loc` `iloc` and `groupby` in order to properly present the data as these functionsallowed for the presenting of specific parts of the data and as such served to present the scores and which schools they came from. This locating of specific parts of the data was further helped with functions such as `describe` which was a quick way to create sumarries for impotant parts of the data set and present the overall trends and averages in the data. 
- As for the analysis of the data itself it showed no major trends in favor of chter or public schools in terms of performance except in the case of reading scores in the 11th grade charter which are signifigantly higher on average than any other scores. As for other trends in the data there is a clear difference in math and reading scores as on average the math scores were around 10 points lower outside of grades 9 and 10 in the charter schools implying better teaching during those early charter school grades.
## Possible Further Analysis 
- As for possible further analysis it would possibly be of benefit in coming to conclusions on the data if more data was presented in breaking down the scores by the different specific schools in order to check for how specific schools are affecting the average and if there is any variation in those trends between charter and public.